
## Plan Result




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.prow_gatekeeper.kubectl_manifest.constraint_templates[&#34;# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \&#34;:latest\&#34;)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has image &lt;%v&gt; with latest tag, using latest tag is not allowed\&#34;, [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \&#34;:latest\&#34;)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has image &lt;%v&gt; with latest tag, using latest tag is not allowed\&#34;, [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has an invalid image repo &lt;%v&gt;, allowed repos are %v\&#34;, [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has an invalid image repo &lt;%v&gt;, allowed repos are %v\&#34;, [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }&#34;]
  * module.tekton_gatekeeper.kubectl_manifest.constraint_templates[&#34;# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \&#34;:latest\&#34;)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has image &lt;%v&gt; with latest tag, using latest tag is not allowed\&#34;, [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \&#34;:latest\&#34;)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has image &lt;%v&gt; with latest tag, using latest tag is not allowed\&#34;, [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has an invalid image repo &lt;%v&gt;, allowed repos are %v\&#34;, [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\&#34;msg\&#34;: msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\&#34;container &lt;%v&gt; in namespace &lt;%v&gt; has an invalid image repo &lt;%v&gt;, allowed repos are %v\&#34;, [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.trusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;external-secrets\&#34;\n      - \&#34;gatekeeper-system\&#34;\n  parameters:\n    images:\n      - \&#34;ghcr.io/external-secrets/external-secrets\&#34;\n      - \&#34;docker.io/openpolicyagent/gatekeeper\&#34;\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.constraints[&#34;# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\&#34;\&#34;]\n        kinds: [\&#34;Pod\&#34;]\n    namespaces:\n      - \&#34;default\&#34;\n  parameters:\n    images:\n      - \&#34;docker.io/aquasec/trivy\&#34;\n      - \&#34;docker.io/zricethezav/gitleaks\&#34;\n      - \&#34;docker.io/maven\&#34;\n      - \&#34;gcr.io/k8s-prow/checkconfig\&#34;\n      - \&#34;gcr.io/k8s-prow/generic-autobumper\&#34;\n      - \&#34;gcr.io/k8s-prow/label_sync\&#34;\n      - \&#34;gcr.io/k8s-prow/branchprotector\&#34;\n      - \&#34;gcr.io/k8s-prow/commenter\&#34;\n      - \&#34;gcr.io/k8s-prow/gencred\&#34;\n      - \&#34;gcr.io/k8s-prow/sidecar\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/clonerefs\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/initupload\&#34; # prowjob decoration\n      - \&#34;gcr.io/k8s-prow/entrypoint\&#34; # prowjob decoration\n      - \&#34;eu.gcr.io/kyma-project\&#34;\n      - \&#34;eu.gcr.io/sap-kyma-neighbors-dev\&#34;\n      - \&#34;europe-docker.pkg.dev/kyma-project\&#34;\n      - \&#34;europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\&#34;&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prow_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8sallowedimages"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1beta1
            kind: ConstraintTemplate
            metadata:
              name: k8sallowedimages
            spec:
              crd:
                spec:
                  names:
                    kind: K8sAllowedImages
                  validation:
                    openAPIV3Schema:
                      properties:
                        images:
                          items:
                            description: A list of allowed image URLs. Each image URL must be
                              a prefix of the image URL used in the Pod spec.
                            type: string
                          type: array
              targets:
              - rego: |-
                  package k8sallowedimages
                  # Check containers are not using latest tag.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.containers[_]
                    # Check if object is using an image with latest tag.
                    strings.endswith(container.image, ":latest")
                    msg := sprintf("container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed", [container.name, input.review.object.metadata.namespace, container.image])
                  }
            
                  # Check init containers are not using latest tag.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.initContainers[_]
                    # Check if object is using an image with latest tag.
                    strings.endswith(container.image, ":latest")
                    msg := sprintf("container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed", [container.name, input.review.object.metadata.namespace, container.image])
                  }
                  # Check containers are using allowed images.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.containers[_]
                    # Check object is using an image that is not allowed.
                    not strings.any_prefix_match(input.parameters.images, container.image)
                    msg := sprintf("container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])
                  }
            
                  # Check init containers are using allowed images.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.initContainers[_]
                    # Check object is using an image that is not allowed.
                    not strings.any_prefix_match(input.parameters.images, container.image)
                    msg := sprintf("container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.tekton_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          strings.endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(input.parameters.images, container.image)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"] will be created
  + resource "kubectl_manifest" "constraint_templates" {
      + api_version             = "templates.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConstraintTemplate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "k8sallowedimages"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: templates.gatekeeper.sh/v1beta1
            kind: ConstraintTemplate
            metadata:
              name: k8sallowedimages
            spec:
              crd:
                spec:
                  names:
                    kind: K8sAllowedImages
                  validation:
                    openAPIV3Schema:
                      properties:
                        images:
                          items:
                            description: A list of allowed image URLs. Each image URL must be
                              a prefix of the image URL used in the Pod spec.
                            type: string
                          type: array
              targets:
              - rego: |-
                  package k8sallowedimages
                  # Check containers are not using latest tag.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.containers[_]
                    # Check if object is using an image with latest tag.
                    strings.endswith(container.image, ":latest")
                    msg := sprintf("container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed", [container.name, input.review.object.metadata.namespace, container.image])
                  }
            
                  # Check init containers are not using latest tag.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.initContainers[_]
                    # Check if object is using an image with latest tag.
                    strings.endswith(container.image, ":latest")
                    msg := sprintf("container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed", [container.name, input.review.object.metadata.namespace, container.image])
                  }
                  # Check containers are using allowed images.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.containers[_]
                    # Check object is using an image that is not allowed.
                    not strings.any_prefix_match(input.parameters.images, container.image)
                    msg := sprintf("container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])
                  }
            
                  # Check init containers are using allowed images.
                  violation[{"msg": msg}] {
                    container := input.review.object.spec.initContainers[_]
                    # Check object is using an image that is not allowed.
                    not strings.any_prefix_match(input.parameters.images, container.image)
                    msg := sprintf("container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])
                  }
                target: admission.k8s.gatekeeper.sh
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"docker.io/openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-tools-namespaces"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-tools-namespaces
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - external-secrets
                - gatekeeper-system
              parameters:
                images:
                - ghcr.io/external-secrets/external-secrets
                - docker.io/openpolicyagent/gatekeeper
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-prowjobs-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-prowjobs-namespace
            spec:
              enforcementAction: warn
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - docker.io/aquasec/trivy
                - docker.io/zricethezav/gitleaks
                - docker.io/maven
                - gcr.io/k8s-prow/checkconfig
                - gcr.io/k8s-prow/generic-autobumper
                - gcr.io/k8s-prow/label_sync
                - gcr.io/k8s-prow/branchprotector
                - gcr.io/k8s-prow/commenter
                - gcr.io/k8s-prow/gencred
                - gcr.io/k8s-prow/sidecar
                - gcr.io/k8s-prow/clonerefs
                - gcr.io/k8s-prow/initupload
                - gcr.io/k8s-prow/entrypoint
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 35, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  35: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7954,"Program":"tfcmt","SHA1":"ff85d119015861d3ce8651f9b9eb5079f3df8a51","Vars":{}} -->